Расширение/Documents/СписаниеНедостачТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СписаниеНедостачТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГозКонтракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КонтрактыГОЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДелатьДвиженияПоРезервамТоваровОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оприходование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГОЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьиРасходовГоз</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение/Documents/СписаниеНедостачТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура Buro1Goz_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации = Элементы.Добавить("НеДелатьДвиженияПоРезервамТоваровОрганизации", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.Вид = ВидПоляФормы.ПолеФлажка;                            
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.ПутьКДанным = "Объект.НеДелатьДвиженияПоРезервамТоваровОрганизации";
	
	ПолеОприходование = Элементы.Добавить("Оприходование", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	ПолеОприходование.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеОприходование.ПутьКДанным = "Объект.Оприходование";
		
	СтраницаГВ_ГОЗ  = Элементы.Добавить("ГОЗ", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	СтраницаГВ_ГОЗ.Заголовок = НСтр("ru = 'Контракты ГОЗ'");
	СтраницаГВ_ГОЗ.Вид = ВидГруппыФормы.Страница;
	
	ПолеДляДокГОЗ = Элементы.Добавить("B1_КонтрактыГОЗ", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеДляДокГОЗ.Заголовок = "Контракт ГОЗ(документ)";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.ГозКонтракт";    
	
	ТЧРасходыГОЗ = Элементы.Добавить("B1_ТЧ_ГОЗ", Тип("ТаблицаФормы"), СтраницаГВ_ГОЗ);
	ТЧРасходыГОЗ.ПутьКДанным = "Объект.ГОЗ";
	ТЧРасходыГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;    
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабЧасти = Об.Метаданные().ТабличныеЧасти;	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.СтандартныеРеквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.Реквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
КонецПроцедуры
